---
<h1>Week 2: Practical Pandas</h1>


---

---
<h1>RECAP</h1>

<h4>
<ol>
    <li>Numpy Arrays</li>
    <li>Pandas Series</li>
    <li>Pandas DataFrames</li>
    <li>Basic Manipulation in Pandas DataFrames</li>
</ol>
</h4>

---

In [2]:
# If you haven't so

!pip install pandas
!pip install numpy

Requirement already satisfied: pandas in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.3 -> 26.0
[notice] To update, run: python3 -m pip install --upgrade pip
Requirement already satisfied: numpy in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.4.1)

[notice] A new release of pip is available: 25.3 -> 26.0
[notice] To update, run: python3 -m pip install --upgrade pip

In [3]:
import pandas as pd
import numpy as np

---
<h2>This Week we will focus on advanced and practical pandas</h2>

1. Topic 1 (50 mins): Advanced Pandas
2. Topic 2 (50 mins): Practical Pandas

---

---
<h2>Topic 1: Advanced Pandas </h2>

---

In [4]:
# Example Data for Diabetes

df = pd.DataFrame({"height": [146, 151, 167, 176], "weight": [95, 55, 67, 92], "diabetes": [True, False, False, False]})

df

   height  weight  diabetes
0     146      95      True
1     151      55     False
2     167      67     False
3     176      92     False

---
<h4>Task 1</h4>
For every row, we want to create a new column called "obese" with these conditions:

1. if height < 180 and weight > 90
2. if weight > 90 and diabetes is true
---

In [5]:
def is_obese(row):
  if row["height"] < 180 and row["weight"] > 90:
    return True
  elif row["weight"] > 90 and row["diabetes"] == "Yes":
    return True
  else:
    return False

df["obese"] = df.apply(is_obese, axis=1)
df

   height  weight  diabetes  obese
0     146      95      True   True
1     151      55     False  False
2     167      67     False  False
3     176      92     False   True

---
<h4>Task 2</h4>
For every row, we want to create a series called "means" that includs each column's means (if numeric) and mode (if binary)

---

In [6]:
def mean_check(x):
    if x.dtype == "int64":
        return x.mean()
    if x.dtype == "bool":
        return x.mode()
means = df.apply(mean_check, axis=0)
means

height                                               160.0
weight                                               77.25
diabetes            0    False
Name: diabetes, dtype: bool
obese       0    False
1     True
Name: obese, dtype: bool
dtype: object

<img src="./images/apply.jpg"/>

---
<h1>Pandas Group By</h1>

---

---
<h4>Task 2</h4>
We want to create a dataframe with two rows: diabetes and non diabetes, each row must contain the mean in their respective group

---

In [7]:
g = df.groupby("diabetes")

# creates a groupby object

In [8]:
def means(x):
    return x.mean()

my_df = g.agg({"height": means, "weight": means, "obese": means})

my_df

              height     weight     obese
diabetes
False     164.666667  71.333333  0.333333
True      146.000000  95.000000  1.000000

<img src="./images/agg.jpg">

In [9]:
df2 = pd.DataFrame({"ID": [119, 121, 885, 635, 734, 85, 122, 152, 537], "country": ["US", "UK", "AUS", "NZ", "US", "US", "AUS", "NZ", "UK"], "score": [170, 110, 121, 155, 75, 66, 120, 117, 165], "bench": [120, 110, 135, 125, 121, 117, 122, 132, 136]})

df2

    ID country  score  bench
0  119      US    170    120
1  121      UK    110    110
2  885     AUS    121    135
3  635      NZ    155    125
4  734      US     75    121
5   85      US     66    117
6  122     AUS    120    122
7  152      NZ    117    132
8  537      UK    165    136

---
Task: Get a series that displays each country's mean bench and max score with respect to their group

---

In [10]:
def means(x):
    return x.mean()

def maxs(x):
    return x.max()

g = df2.groupby("country")

result = g.agg({"score": maxs, "bench": means})

result

         score       bench
country
AUS        121  128.500000
NZ         155  128.500000
UK         165  123.000000
US         170  119.333333

---
<h3>Topic 1 Practice</h3>

---

In [11]:
df = pd.DataFrame({"Date": pd.to_datetime(["2025-01-05", "2025-01-07", "2025-01-09", "2025-01-22", "2025-01-27", "2025-01-17", "2025-02-01", "2025-02-05", "2025-02-17", "2025-02-18", "2025-02-24", "2025-03-01", "2025-03-07", "2025-04-02"]), 
                   "Price": [15, 18, 250, 19, 5, 720, 75, 15, 16, 78, 120, 44, 32, 17], 
                   "Weight": [12.5, 11.5, 60, 23, 6, 120, 7, 72, 3, 5, 12.5, 11.5, 16.2, 27], 
                   "Category": ["Ceramic", "Ceramic", "Gadget", "Kitchen", "Kitchen", "Furniture", "Ceramic", "Ceramic", "Gadget", "Furniture", "Gadget", "Stationery", "Stationery", "Stationery"], 
                   "Location": ["Bristol", "Bristol", "London", "Bristol", "Manchester", "Manchester", "Leeds", "Bristol", "London", "London", "Cambridge", "Brighton", "Brighton", "Leeds"]})

df

         Date  Price  Weight    Category    Location
0  2025-01-05     15    12.5     Ceramic     Bristol
1  2025-01-07     18    11.5     Ceramic     Bristol
2  2025-01-09    250    60.0      Gadget      London
3  2025-01-22     19    23.0     Kitchen     Bristol
4  2025-01-27      5     6.0     Kitchen  Manchester
5  2025-01-17    720   120.0   Furniture  Manchester
6  2025-02-01     75     7.0     Ceramic       Leeds
7  2025-02-05     15    72.0     Ceramic     Bristol
8  2025-02-17     16     3.0      Gadget      London
9  2025-02-18     78     5.0   Furniture      London
10 2025-02-24    120    12.5      Gadget   Cambridge
11 2025-03-01     44    11.5  Stationery    Brighton
12 2025-03-07     32    16.2  Stationery    Brighton
13 2025-04-02     17    27.0  Stationery       Leeds

<h4>Task 1: Make a new column called weight_to_price that is essentially weight / price </h4>

In [12]:
# Your code here

<h4>Task 2: Make a new column called "suspicious" with these conditions:</h4>

1. If weight_to_price > 1 and category is not furniture or kitchen then give it a score of 10
2. If it's ceramic, from brighton and it's sold on january then give it a score of 20
3. If weight_to_price > 2, and it's ceramic and it's sold on february then give it a score of 30

In [13]:
# Your code here

<h4>Task 3: remove the top 10% most suspicious items in the dataframe, you may round up if there are decimal points</h4>

In [14]:
# Your code here

<h4>Task 4: Make a new series called location_std that:</h4>

1. Each row is a location
2. It contains the standard deviation (look up in google) of weight_to_price ratio
3. It contains the least suspicious item in that location

In [15]:
# Your code here

---
<h2>Topic 2: Practical Pandas</h2>

---

we have talked a lot about theory, but now let's focus on real life pandas.

In real life, we don't make up dataframes, we receive or extract it from external sources, run this code below to extract data from a CSV file (comma separated file)

In [35]:
df = pd.read_csv("./co2_emissions.csv")
df

,Make,Model,Vehicle Class,Engine Size(L),Cylinders,Transmission,Fuel Type,Fuel Consumption City (L/100 km),Fuel Consumption Hwy (L/100 km),Fuel Consumption Comb (L/100 km),Fuel Consumption Comb (mpg),CO2 Emissions(g/km)
0,ACURA,ILX,COMPACT,2,4,AS5,Z,9.9,6.7,8.5,33,196
1,ACURA,ILX,COMPACT,2.4,4,M6,Z,11.2,7.7,9.6,29,221
2,acura,ILX,COMPACT,2.7,7,M4,Z,12.0,8,10,30,332
3,ACURA,ILX HYBRID,COMPACT,1.5,4,AV7,Z,6.0,5.8,5.9,48,136
4,ACURA,MDX 4WD,SUV - SMALL,3.5,6,AS6,Z,12.7,9.1,11.1,25,255
...,...,...,...,...,...,...,...,...,...,...,...,...
7387,VOLVO,XC40 T5 AWD,SUV - SMALL,2,4,AS8,Z,10.7,7.7,9.4,30,219
7388,VOLVO,XC60 T5 AWD,SUV - SMALL,2,4,AS8,Z,11.2,8.3,9.9,29,232
7389,VOLVO,XC60 T6 AWD,SUV - SMALL,2,4,AS8,Z,11.7,8.6,10.3,27,240
7390,VOLVO,XC90 T5 AWD,SUV - STANDARD,2,4,AS8,Z,11.2,8.3,9.9,29,232
7391,VOLVO,XC90 T6 AWD,SUV - STANDARD,2,4,AS8,Z,12.2,8.7,10.7,26,248

What is this data telling us? What is the context behind it?

---
<h2>Pandas Datatypes</h2>

---

In modern pandas, there are a few data types but the common ones are:

1. Int64
2. Float64
3. Object
4. Datetime

Int and Float are numerical data, and objects are stored in strings. When you mix multiple data together, we get an "object" column. And that helps data analyst's in cleaning and fixing <bold> mechanical errors </bold>.

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7392 entries, 0 to 7391
Data columns (total 12 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Make                              7392 non-null   object
 1   Model                             7392 non-null   object
 2   Vehicle Class                     7392 non-null   object
 3   Engine Size(L)                    7391 non-null   object
 4   Cylinders                         7392 non-null   int64
 5   Transmission                      7391 non-null   object
 6   Fuel Type                         7392 non-null   object
 7   Fuel Consumption City (L/100 km)  7391 non-null   float64
 8   Fuel Consumption Hwy (L/100 km)   7391 non-null   object
 9   Fuel Consumption Comb (L/100 km)  7392 non-null   object
 10  Fuel Consumption Comb (mpg)       7392 non-null   int64
 11  CO2 Emissions(g/km)               7391 non-null   object
dtypes: float64(1), int64(2), object(9)
memory usage: 693.1+ KB

<h2>Step 1: Mechanical Errors</h2>

first step of cleaning is to generally ignore columns with datatypes that aren't objects, because they don't have any mechanical errors, (maybe semantic / statistical ones) but we'll get to them later in the next two weeks

In [37]:
cols_obj = [x for x in df.columns if df[x].dtype == "object"] # get all object dtypes
cols_obj

['Make',
 'Model',
 'Vehicle Class',
 'Engine Size(L)',
 'Transmission',
 'Fuel Type',
 'Fuel Consumption Hwy (L/100 km)',
 'Fuel Consumption Comb (L/100 km)',
 'CO2 Emissions(g/km)']

In [41]:
df['Make'].unique() # there are mechanical errors with naming etc

array(['ACURA', 'acura', 'ALFA ROMEO', 'aflaromeo', 'ASTON MARTIN',
       'AUDI', 'BENTLEY', 'BMW', 'BUICK', 'CADILLAC', 'CHEVROLET',
       'CHRYSLER', 'DODGE', 'dodge', 'FIAT', 'FORD', 'GMC', 'HONDA',
       'HYUNDAI', 'INFINITI', 'infiniti', 'JAGUAR', 'JEEP', 'KIA',
       'LAMBORGHINI', 'LAND ROVER', 'LEXUS', 'LINCOLN', 'MASERATI',
       'MAZDA', 'MERCEDES-BENZ', 'MINI', 'MITSUBISHI', 'NISSAN',
       'PORSCHE', 'RAM', 'ROLLS-ROYCE', 'SCION', 'SMART', 'SRT', 'SUBARU',
       'TOYOTA', 'VOLKSWAGEN', 'VOLVO', 'GENESIS', 'BUGATTI'],
      dtype=object)

In [43]:
df.replace("acura", "ACURA", inplace=True) # how you replace values in a dataset
df['Make'].unique()

array(['ACURA', 'ALFA ROMEO', 'aflaromeo', 'ASTON MARTIN', 'AUDI',
       'BENTLEY', 'BMW', 'BUICK', 'CADILLAC', 'CHEVROLET', 'CHRYSLER',
       'DODGE', 'dodge', 'FIAT', 'FORD', 'GMC', 'HONDA', 'HYUNDAI',
       'INFINITI', 'infiniti', 'JAGUAR', 'JEEP', 'KIA', 'LAMBORGHINI',
       'LAND ROVER', 'LEXUS', 'LINCOLN', 'MASERATI', 'MAZDA',
       'MERCEDES-BENZ', 'MINI', 'MITSUBISHI', 'NISSAN', 'PORSCHE', 'RAM',
       'ROLLS-ROYCE', 'SCION', 'SMART', 'SRT', 'SUBARU', 'TOYOTA',
       'VOLKSWAGEN', 'VOLVO', 'GENESIS', 'BUGATTI'], dtype=object)

<h2>The Three Types of Errors in Pandas</h2>

<img src="./images/errors.jpg"/>

<h2>Practical Pandas Practice!</h2>

Task 1: use df.apply to turn every object column to uppercase and remove all spaces

In [ ]:
# Your solution here


# HINT for a given string
x = " HellO There  "

print(x.upper()) # makes every letter uppercase

print(x.replace(" ", "")) # removes all spaces

 HELLO THERE
HellOThere

Task 2: for every object column, fix the mechanical errors, turning all missing, null or nan values into proper null data type

In [54]:
# Your solution here

# HINT: to replace values to null, use np.nan like so:

x = pd.Series([1, 2, "missing"])
x.replace("missing", np.nan, inplace=True)
x.dtype

/tmp/ipykernel_1572/1508823204.py:6: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  x.replace("missing", np.nan, inplace=True)

dtype('float64')

Task 3: remove every duplicate rows

In [ ]:
# Your solution here

# HINT: Remember to use df.drop(x, axis=0) for rows

By now, you must have a dataframe with

1. No mixed datatypes
2. Fixed all object columns (categorical)

We can now go to step 2

<h2>Step 2: Missing Values</h2>

There are a lot of different ways to deal with missing values, but some common ones are:

1. mean / median replacement for numerical data
2. mode replacement for categorical data

Task: replace all missing values with their means if they are a numeric column, and replace the categorical columns if they are object

In [55]:
# Your solution here

<h2>Step 3: Statistical Errors</h2>

There are also a lot of different statistical errors, but for this course, we're focussed on removing outliers.

Task: remove all outliers for each numerical columns using the interquartile range method (you may search this on google)

In [ ]:
# Your solution here